betaflight/betaflight/src/platform/common/stm32/io_def_generated.h
# define DEFIO_REC__PH14 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_H_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT)
#else
# define DEFIO_TAG__PH14 defio_error_PH14_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PH14 DEFIO_TAG_E__NONE
# define DEFIO_REC__PH14 defio_error_PH14_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_H_USED_MASK & BIT(15)
# define DEFIO_TAG__PH15 DEFIO_TAG_MAKE(DEFIO_GPIOID__H, 15)
# define DEFIO_TAG_E__PH15 DEFIO_TAG_MAKE(DEFIO_GPIOID__H, 15)
# define DEFIO_REC__PH15 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_H_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT)
#else
# define DEFIO_TAG__PH15 defio_error_PH15_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PH15 DEFIO_TAG_E__NONE
# define DEFIO_REC__PH15 defio_error_PH15_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(0)
# define DEFIO_TAG__PI0 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 0)
# define DEFIO_TAG_E__PI0 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 0)
# define DEFIO_REC__PI0 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI0 defio_error_PI0_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI0 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI0 defio_error_PI0_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(1)
# define DEFIO_TAG__PI1 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 1)
# define DEFIO_TAG_E__PI1 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 1)
# define DEFIO_REC__PI1 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI1 defio_error_PI1_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI1 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI1 defio_error_PI1_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(2)
# define DEFIO_TAG__PI2 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 2)
# define DEFIO_TAG_E__PI2 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 2)
# define DEFIO_REC__PI2 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI2 defio_error_PI2_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI2 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI2 defio_error_PI2_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(3)
# define DEFIO_TAG__PI3 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 3)
# define DEFIO_TAG_E__PI3 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 3)
# define DEFIO_REC__PI3 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI3 defio_error_PI3_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI3 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI3 defio_error_PI3_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(4)
# define DEFIO_TAG__PI4 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 4)
# define DEFIO_TAG_E__PI4 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 4)
# define DEFIO_REC__PI4 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI4 defio_error_PI4_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI4 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI4 defio_error_PI4_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(5)
# define DEFIO_TAG__PI5 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 5)
# define DEFIO_TAG_E__PI5 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 5)
# define DEFIO_REC__PI5 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI5 defio_error_PI5_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI5 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI5 defio_error_PI5_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(6)
# define DEFIO_TAG__PI6 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 6)
# define DEFIO_TAG_E__PI6 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 6)
# define DEFIO_REC__PI6 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI6 defio_error_PI6_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI6 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI6 defio_error_PI6_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(7)
# define DEFIO_TAG__PI7 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 7)
# define DEFIO_TAG_E__PI7 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 7)
# define DEFIO_REC__PI7 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI7 defio_error_PI7_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI7 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI7 defio_error_PI7_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(8)
# define DEFIO_TAG__PI8 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 8)
# define DEFIO_TAG_E__PI8 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 8)
# define DEFIO_REC__PI8 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI8 defio_error_PI8_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI8 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI8 defio_error_PI8_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(9)
# define DEFIO_TAG__PI9 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 9)
# define DEFIO_TAG_E__PI9 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 9)
# define DEFIO_REC__PI9 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI9 defio_error_PI9_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI9 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI9 defio_error_PI9_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(10)
# define DEFIO_TAG__PI10 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 10)
# define DEFIO_TAG_E__PI10 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 10)
# define DEFIO_REC__PI10 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI10 defio_error_PI10_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI10 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI10 defio_error_PI10_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(11)
# define DEFIO_TAG__PI11 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 11)
# define DEFIO_TAG_E__PI11 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 11)
# define DEFIO_REC__PI11 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI11 defio_error_PI11_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI11 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI11 defio_error_PI11_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(12)
# define DEFIO_TAG__PI12 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 12)
# define DEFIO_TAG_E__PI12 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 12)
# define DEFIO_REC__PI12 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI12 defio_error_PI12_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI12 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI12 defio_error_PI12_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(13)
# define DEFIO_TAG__PI13 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 13)
# define DEFIO_TAG_E__PI13 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 13)
# define DEFIO_REC__PI13 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI13 defio_error_PI13_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI13 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI13 defio_error_PI13_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(14)
# define DEFIO_TAG__PI14 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 14)
# define DEFIO_TAG_E__PI14 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 14)
# define DEFIO_REC__PI14 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI14 defio_error_PI14_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI14 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI14 defio_error_PI14_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_I_USED_MASK & BIT(15)
# define DEFIO_TAG__PI15 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 15)
# define DEFIO_TAG_E__PI15 DEFIO_TAG_MAKE(DEFIO_GPIOID__I, 15)
# define DEFIO_REC__PI15 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_I_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT)
#else
# define DEFIO_TAG__PI15 defio_error_PI15_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PI15 DEFIO_TAG_E__NONE
# define DEFIO_REC__PI15 defio_error_PI15_is_not_supported_on_TARGET
#endif


#if DEFIO_PORT_J_USED_MASK & BIT(0)
# define DEFIO_TAG__PJ0 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 0)
# define DEFIO_TAG_E__PJ0 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 0)
# define DEFIO_REC__PJ0 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ0 defio_error_PJ0_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ0 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ0 defio_error_PJ0_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(1)
# define DEFIO_TAG__PJ1 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 1)
# define DEFIO_TAG_E__PJ1 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 1)
# define DEFIO_REC__PJ1 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ1 defio_error_PJ1_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ1 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ1 defio_error_PJ1_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(2)
# define DEFIO_TAG__PJ2 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 2)
# define DEFIO_TAG_E__PJ2 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 2)
# define DEFIO_REC__PJ2 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ2 defio_error_PJ2_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ2 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ2 defio_error_PJ2_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(3)
# define DEFIO_TAG__PJ3 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 3)
# define DEFIO_TAG_E__PJ3 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 3)
# define DEFIO_REC__PJ3 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ3 defio_error_PJ3_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ3 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ3 defio_error_PJ3_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(4)
# define DEFIO_TAG__PJ4 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 4)
# define DEFIO_TAG_E__PJ4 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 4)
# define DEFIO_REC__PJ4 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ4 defio_error_PJ4_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ4 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ4 defio_error_PJ4_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(5)
# define DEFIO_TAG__PJ5 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 5)
# define DEFIO_TAG_E__PJ5 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 5)
# define DEFIO_REC__PJ5 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ5 defio_error_PJ5_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ5 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ5 defio_error_PJ5_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(6)
# define DEFIO_TAG__PJ6 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 6)
# define DEFIO_TAG_E__PJ6 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 6)
# define DEFIO_REC__PJ6 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ6 defio_error_PJ6_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ6 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ6 defio_error_PJ6_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(7)
# define DEFIO_TAG__PJ7 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 7)
# define DEFIO_TAG_E__PJ7 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 7)
# define DEFIO_REC__PJ7 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ7 defio_error_PJ7_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ7 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ7 defio_error_PJ7_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(8)
# define DEFIO_TAG__PJ8 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 8)
# define DEFIO_TAG_E__PJ8 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 8)
# define DEFIO_REC__PJ8 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ8 defio_error_PJ8_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ8 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ8 defio_error_PJ8_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(9)
# define DEFIO_TAG__PJ9 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 9)
# define DEFIO_TAG_E__PJ9 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 9)
# define DEFIO_REC__PJ9 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ9 defio_error_PJ9_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ9 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ9 defio_error_PJ9_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(10)
# define DEFIO_TAG__PJ10 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 10)
# define DEFIO_TAG_E__PJ10 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 10)
# define DEFIO_REC__PJ10 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ10 defio_error_PJ10_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ10 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ10 defio_error_PJ10_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(11)
# define DEFIO_TAG__PJ11 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 11)
# define DEFIO_TAG_E__PJ11 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 11)
# define DEFIO_REC__PJ11 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ11 defio_error_PJ11_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ11 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ11 defio_error_PJ11_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(12)
# define DEFIO_TAG__PJ12 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 12)
# define DEFIO_TAG_E__PJ12 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 12)
# define DEFIO_REC__PJ12 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ12 defio_error_PJ12_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ12 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ12 defio_error_PJ12_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(13)
# define DEFIO_TAG__PJ13 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 13)
# define DEFIO_TAG_E__PJ13 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 13)
# define DEFIO_REC__PJ13 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ13 defio_error_PJ13_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ13 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ13 defio_error_PJ13_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(14)
# define DEFIO_TAG__PJ14 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 14)
# define DEFIO_TAG_E__PJ14 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 14)
# define DEFIO_REC__PJ14 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ14 defio_error_PJ14_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ14 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ14 defio_error_PJ14_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_J_USED_MASK & BIT(15)
# define DEFIO_TAG__PJ15 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 15)
# define DEFIO_TAG_E__PJ15 DEFIO_TAG_MAKE(DEFIO_GPIOID__J, 15)
# define DEFIO_REC__PJ15 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_J_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)
#else
# define DEFIO_TAG__PJ15 defio_error_PJ15_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PJ15 DEFIO_TAG_E__NONE
# define DEFIO_REC__PJ15 defio_error_PJ15_is_not_supported_on_TARGET
#endif


// DEFIO_IO_USED_COUNT is number of io pins supported on target
#define DEFIO_IO_USED_COUNT (DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT+DEFIO_PORT_J_USED_COUNT)

